{
    "error": "Invalid JSON",
    "raw_output": "{\n  \"full_name\": null,\n  \"contact_info\": {\n    \"email\": null,\n    \"phone\": null,\n    \"linkedin\": null,\n    \"location\": null\n  },\n  \"summary\": \"To continue work in the Information Technology field while developing my skills in Information Systems and Networking.\",\n  \"years_of_experience\": null,\n  \"experiences\": [\n    {\n      \"title\": \"Information Technology Specialist\",\n      \"company\": \"Company Name\",\n      \"location\": null,\n      \"start_date\": \"April 2015\",\n      \"end_date\": \"Current\",\n      \"bullets\": [\n        \"Set up and maintained the network infrastructure both wired and wireless configuration.\",\n        \"Setup and maintained all user's computers including hardware and software.\",\n        \"Set up and assisted users with their e-mail accounts.\",\n        \"I maintained security on our networks in which only company users could access the network.\",\n        \"Setup and configured users android phones so they could access the company's resources.\",\n        \"I maintained security on all companies' machines.\"\n      ]\n    },\n    {\n      \"title\": \"Computer Technical Specialist\",\n      \"company\": \"Company Name\",\n      \"location\": \"City\",\n      \"start_date\": \"September 2007\",\n      \"end_date\": \"January 2014\",\n      \"bullets\": [\n        \"Set up and maintain all software on Faculty and Staff computers in a Windows and McIntosh environment.\",\n        \"Troubleshoot all software and hardware problems on user's machines.\",\n        \"Check network connectivity issues on the client side.\",\n        \"Set up and maintain all printers' scanners and fax machines for staff and faculty and students.\",\n        \"Configure and setup all PDA s for all faculty and staff.\",\n        \"Help maintain lab computers on the windows and McIntosh environment including hardware software and printing issues.\",\n        \"Assist network Administrators with setting up and maintaining the network and assisting with network issues including routers switches and servers.\",\n        \"This included DHCP server and Domain Controllers using active directory and a layer 3 thru 5 switches.\",\n        \"Captured and pushed images to and from workstations with a ghost server.\",\n        \"Pushed software packages to user's machines using a KBOX server.\",\n        \"Maintaining all classroom projectors which were connected to a smart board including the attached devices.\",\n        \"Installing and troubleshooting all software and hardware issues for the school of Engineering and applied science.\",\n        \"Serve as the primary contact with vendors to maintain licenses.\",\n        \"Maintain a license server to keep software operational.\",\n        \"Set up and maintain intermapper which monitored all switches servers and lab workstations in real time to see if machines were up and running.\",\n        \"Set up virtual machines and installed all software on client machines.\",\n        \"Set up and configured Polycom qdx 6000 video and Tandberg conferencing machines.\",\n        \"Set up and brought down conference calls.\"\n      ]\n    },\n    {\n      \"title\": \"Senior Computer Network Support Technician\",\n      \"company\": null,\n      \"location\": \"City , State\",\n      \"start_date\": \"November 2001\",\n      \"end_date\": \"September 2007\",\n      \"bullets\": [\n        \"Provide statewide data telecommunications and on the-site problem analysis and resolution; consultation; hardware and software installations; technical guidance and support for personal computing equipment.\",\n        \"Provide local and wide area networking support, which included router switch and server and router configurations, and installations and problem resolutions.\",\n        \"Troubleshoot all network components including routers switches servers and patch panels.\",\n        \"Analyzing and diagnosing the network for the correct topology protocols and configurations.\",\n        \"Install and maintain video conferencing systems which included Meeting Point.\",\n        \"Diagnosed and fixed any problems computers may be experiencing including network software, and hardware issues.\"\n      ]\n    },\n    {\n      \"title\": \"Junior Network Administrator\",\n      \"company\": \"Company Name\",\n      \"location\": \"City , State\",\n      \"start_date\": \"September 1999\",\n      \"end_date\": \"November 2001\",\n      \"bullets\": [\n        \"Performed the installation and removal of all programs on a network in a teaching and testing facility.\",\n        \"Assigned rights and permissions to users and servicing them on the network.\",\n        \"Troubleshoot all hardware as well as software problems on the network.\",\n        \"Also configured IP addresses dynamically and statically for new machines on the network using a DHCP server.\",\n        \"Maintaining compatibility of new hardware and software on our network which included routers, switches, and servers as well as workstations.\",\n        \"Reorganized LANs to insure speed and performance.\",\n        \"Installed and maintained all wiring on the network.\"\n      ]\n    }\n  ],\n  \"education\": [\n    {\n      \"degree\": \"Comp A+ Course, Windows 7 course, CompTIA Network+ course, CompTIA Security+ course, Windows Server 2012 class. CCNA Class. Certified Ethical Hacker class.\",\n      \"university\": null,\n      \"start_date\": null,\n      \"end_date\": null,\n      \"gpa\": null\n    },\n    {\n      \"degree\": \"CompTIA Network+ certification, CompTIA Security+ certification CompTIA A+ certification. MCSE - Microsoft Certified Professional Systems Engineer; 2003 CCNA (Cisco Certified Network Associate : 1988\",\n      \"university\": \"Northern Virginia Community College Virginia Commonwealth University\",\n      \"start_date\": null,\n      \"end_date\": null,\n      \"gpa\": \"Dean's Lists GPA: 3.4\"\n    },\n    {\n      \"degree\": \"M.A : Education Biology and General Science\",\n      \"university\": \"George Mason University Fairfax City\",\n      \"start_date\": null,\n      \"end_date\": \"1982\",\n      \"gpa\": null\n    },\n    {\n      \"degree\": \"B.S : Biology\",\n      \"university\": \"NVCC Alexandria A.A.S Networking (06-25-2001) NVCC Alexandria A.A.S Microcomputer Specialization (06-25-2001) Virginia Commonwealth University Richmond\",\n      \"start_date\": null,\n      \"end_date\": null,\n      \"gpa\": null\n    }\n  ],\n  \"certifications\": [],\n  \"projects\": [],\n  \"other_sections\": [],\n  \"skills\": [\n    \"A+\",\n    \"A+ certification\",\n    \"active directory\",\n    \"CCNA\",\n    \"Cisco Certified Network Associate\",\n    \"hardware\",\n    \"consultation\",\n    \"client\",\n    \"DHCP\",\n    \"e-mail\",\n    \"fax machines\",\n    \"ghost\",\n    \"IP\",\n    \"LANs\",\n    \"access\",\n    \"Microsoft Certified Professional\",\n    \"MCSE\",\n    \"Windows 7\",\n    \"Windows\",\n    \"Network\",\n    \"Networking\",\n    \"networks\",\n    \"printers\",\n    \"problem analysis and resolution\",\n    \"protocols\",\n    \"real time\",\n    \"router\",\n    \"routers\",\n    \"scanners\",\n    \"servers\",\n    \"switches\",\n    \"switch\",\n    \"Systems Engineer\",\n    \"teaching\",\n    \"telecommunications\",\n    \"phones\",\n    \"Troubleshoot",
    "skills": [],
    "normalized_skills": [],
    "deterministic_normalized_skills": []
}