{
  "error": "Invalid JSON",
  "raw_output": "{\n  \"full_name\": null,\n  \"contact_info\": {\n    \"email\": null,\n    \"phone\": null,\n    \"linkedin\": null,\n    \"location\": null\n  },\n  \"summary\": \"Dynamic Information Technology Manager with 13 years of IT leadership experience including oversight of infrastructure, application support and cybersecurity services. Dedicated to customer satisfaction with focused delivery of technical solutions. Proven leader in directing operations, maintenance and support of complex systems. Develops creative business solutions, leveraging diverse methodologies and delivering engineering solutions for leading organizations. Highly adept in request for proposal development, technology needs assessments and staff training. Successful in motivating teams to meet demanding timelines by utilizing critical thinking, resource and conflict management and facilitating stakeholder engagement. Innovative and driven with passion for delivering forward thinking, emerging trend technologies.\",\n  \"years_of_experience\": 13,\n  \"experiences\": [\n    {\n      \"title\": \"Director of Information Technology\",\n      \"company\": \"Company Name\",\n      \"location\": \"City , State\",\n      \"start_date\": \"11/2012\",\n      \"end_date\": \"Current\",\n      \"bullets\": [\n        \"Develops, tracks and controls long-term information technology operating budgets and cost and benefit analyses for IT spending initiatives.\",\n        \"Leads and assists technical upgrade projects for clients by coordinating with consultants and developers for data migration and integrations.\",\n        \"Coordinates with management teams to plan, develop, align and execute strategies that would meet client's vision, mission and purpose.\",\n        \"Reviews and assesses architecture design, implementation, testing and deployment needs to identify project requirements and reduce costs 18%.\",\n        \"Plays key role in on-going network design, reevaluation and optimization to keep pace with company growth.\"\n      ]\n    },\n    {\n      \"title\": \"Senior Consulting IT Program Manager\",\n      \"company\": \"Company Name\",\n      \"location\": \"City , State\",\n      \"start_date\": \"12/2014\",\n      \"end_date\": \"12/2020\",\n      \"bullets\": [\n        \"Managed and implemented concurrent projects relating to business process re-engineering, software development and upgrades to foster productivity, throughput, and end-user engagement.\",\n        \"Performed program research and analyzed data collection to develop cost estimates and budgets.\",\n        \"Identified system needs and designed processes to support business requirements.\",\n        \"Collaborated with clients to understand technology staffing requirements and improved productivity while reducing staffing and operational costs by 15%.\",\n        \"Performed risk assessment of stakeholders, senior management, organization, infrastructure, and ITIL governance to effectively plan, develop, and manage schedules, resources, and costs.\",\n        \"Launched Salesforce data cleansing, migration, and integration programs to aid in gathering functional and business requirements to support team, and mitigate risks.\",\n        \"Integrated agile methodologies, emerging AI, digital, and social media technologies into end-user experience to foster adoption, continued engagement and increase sales profit levels 30%.\",\n        \"Executed coordinated project leadership, efficient resource and budget utilization, schedule adherence, implementation of application software, training end users, and problem-solving across multiple product lines.\"\n      ]\n    },\n    {\n      \"title\": \"Business Products Specialist\",\n      \"company\": \"Company Name\",\n      \"location\": \"City , State\",\n      \"start_date\": \"05/2008\",\n      \"end_date\": \"11/2012\",\n      \"bullets\": [\n        \"Developed and fostered relationships with business owners and key executives to assess dynamic risk mitigation and business insurance needs and deliver solutions.\",\n        \"Successfully managed internal & external stakeholder engagement to aid in process and resource improvements to align strategic and industry compliance objectives.\",\n        \"Recorded and integrated CRM data in Salesforce from previous Access and Excel databases, streamlining analysis procedures for efficiency and accuracy.\",\n        \"Planned and executed events and marketing programs, producing 40% of goal of qualified leads.\",\n        \"Exceeded sales goal 12% by effectively applying analyzed data to marketing campaigns and sharing data interdepartmentally.\",\n        \"Informed supervisors and company leaders on markets and regional sales needs to best meet customer needs and maximize revenue.\"\n      ]\n    },\n    {\n      \"title\": \"Product Design Project Team Lead\",\n      \"company\": \"Company Name\",\n      \"location\": \"City , State\",\n      \"start_date\": \"11/2000\",\n      \"end_date\": \"06/2004\",\n      \"bullets\": [\n        \"Demonstrated efficacy throughout project & product life cycles in applying flexible change management deliverables including training, communications, and stakeholder engagement to increase end-user adoption of project implementations.\",\n        \"Supervised four (4) concurrent projects for 16 & 17 Next Gen nuclear core clients in Brazil and South Korea by coordinating planning, designing, testing, budgeting and scheduling tasks.\",\n        \"Developed implementation methodologies to rein in project costs while meeting key milestones.\",\n        \"Provided accurate, detailed quality assessments based on project drawings and technical specifications.\"\n      ]\n    }\n  ],\n  \"education\": [\n    {\n      \"degree\": \"Master of Science : Information Technology Management\",\n      \"university\": \"Western Governors University\",\n      \"start_date\": null,\n      \"end_date\": \"2019\",\n      \"gpa\": null\n    },\n    {\n      \"degree\": \"Bachelor of Science : Business Administration and Management, Marketing and Management, International Business\",\n      \"university\": \"University Of South Carolina - Columbia\",\n      \"start_date\": null,\n      \"end_date\": \"2004\",\n      \"gpa\": null\n    }\n  ],\n  \"certifications\": [\n    {\n      \"title\": \"Certified Associate in Project Management (CAPM)\",\n      \"provider\": null,\n      \"start_date\": null,\n      \"end_date\": \"Expected in 2028\"\n    }\n  ],\n  \"projects\": [],\n  \"other_sections\": [\n    \"Affiliations: Project Management Institute (PMI)   # 6203883, Current Member\"\n  ],\n  \"skills\": [\n    \"Agile framework\",\n    \"Business intelligence\",\n    \"Change management\",\n    \"Collaboration\",\n    \"Conflict resolution\",\n    \"Critical thinking\",\n    \"Data migration\",\n    \"Information technology management\",\n    \"Insurance\",\n    \"ITIL\",\n    \"Organization and time management\",\n    \"Perl\",\n    \"Problem-solving\",\n    \"Project lifecycle management\",\n    \"Project management and leadership\",\n    \"Python\",\n    \"Risk assessment\",\n    \"Salesforce Admin and CRM\",\n    \"SDLC\",\n    \"Six Sigma\",\n    \"SQL (Microsoft and Oracle)\",\n    \"Excellent Verbal and written communication\",\n    \"Agile, Functional, Project leadership,Written communication\",\n    \"AI, Information technology, Project Management\",\n    \"Budgeting, Insurance, Python\",\n    \"Budgets, ITIL, Quality\",\n    \"Budget, Leadership, Research\",\n    \"Business intelligence, Marketing, Risk assessment\",\n    \"Business process re-engineering, Access, Sales\",\n    \"Change management, Excel, Scheduling\",\n    \"Conflict resolution, Migration, SDLC\",\n    \"Critical thinking, Network design, Six Sigma\",\n    \"CRM, Next, Software development\",\n    \"Clients, Optimization, SQL\",\n    \"Client, Oracle, Staffing\",\n    \"Data collection, Perl, Strategic\",\n    \"Data migration, Problem-solving, Time management\",\n    \"Databases,"
}